<template>
  <view>
    <rich-text v-if="judge == 0">
      <view class="text-sm" style="text-align: center">用户条款</view>
      <text class="text-sm"
        >\t E校拼平台由天津毅襄科技发展有限公司研发提供，平台所提供的各项服务的所有权和运营权，均归属于天津毅襄科技发展有限公司所有。
        用户使用协议（以下简称“本协议”）系用户因使用E校拼平台的各项服务，而与E校拼平台订立的正式的、完整的协议。用户在平台注册，即表示接受本协议的所有条款和内容。用户部分或全部不接受本协议条款的，不得使用E校拼平台或使用E校拼平台所提供的服务。
        用户与E校拼平台签订的书面合同与本协议不一致的，以书面合同为准。</text
      >
      <text class="text-sm">
        1.E校拼平台：包括E校拼APP、冠以“E校拼”字样的微信公众号与订阅号、E校拼官方网站（www.exiaopin.cn）等，以及E校拼更新和推出的其他平台，以下简称“E校拼”。
        2.E校拼平台服务：通过互联网以E校拼平台网站、客户端、微信公众号等在内的各种形态（包括未来技术发展出现的新的服务形态）向用户提供的各项服务。 3.E校拼平台规则：包括
        1）所有E校拼平台规则频道内已经发布的，以及后续发布的全部规则、解读、公告等内容； 2）各平台上发布的各类规则、实施细则、产品流程说明、公告等；
        3）以及上述规则的不时修订文本。E校拼所提供的各项服务的运营权，均归属于本公司。客户在E校拼注册，即表示接受本协议的所有条件和条款。部分或全部不接受本协议条款的，不得使用E校拼平台。
        4.用户：在E校拼平台注册或使用E校拼平台服务的主体，都是本协议所指用户。凡使用同一身份认证信息或经E校拼排查认定多个E校拼账户的实际控制人为同一人的，均视为同一用户。
        5、请用户确保每票快件价值不超过5000元。客户寄递价值超过5000元的，应当在下单时向自由服务人员声明。客户未声明，该快件因可归责于自由服务人员的原因毁损、灭失时，赔偿金额将仅按照不超过5000元的一般快件的赔偿标准加以确定。
        E校拼是为自由服务人员提供自由服务人员信息管理、配送信息浏览与查询、配送交易撮合与处理、订单查询与管理、代理配送费磋商与谈判、配送费用代收代付、争议调解等互联网信息服务和在线交易处理服务的网络平台。E校拼并非配送服务的需求方，也非配送服务的提供者。在客户与自由服务人员达成交易的过程中，E校拼仅起居间摄合作用，E校拼平台并不参与客户与自由服务人员之间的配送交易。客户与自由服务人员之间因履行配送合同发生争议的，应当根据合同相对性原则向对方主张权利，并自行协商处理或寻求E校拼平台调解争议。
        6、客户，是指在E校拼发布的配送订单的需求方。 7、客户对自己账户及余额，对应手机号码有保管的义务，未尽到保管义务，需独立承担责任、损失。
        8、该账户不允许用来从事违反相关法律法规的行为，如违反法规或侵害到E校拼或他人权益的，须自行承担全部责任和赔偿一切损失，与E校拼无关。
        9、客户下单详细信息是本契约的组成部分，本契约自客户下单成功，且将快件交付给自由服务人员揽收成功后成立。客户下单委托配送的费用支出按照E校拼公示的收费规则收取，下单时E校拼会有相关提示，下单成功即表示接受该费用标准。
        10、为保证快件安全、及时送达，客户寄件时应履行以下义务： 1)
        如实申报快件内容和价值，并准确、清楚地填写客户、收件人的名称、地址、联系电话等资料。如地址不正确、联系方式错误、收件人拒收等原因而造成无法派送的快件，若客户要求退回，双程费用均由客户承担。 2)
        根据快件的性质（尤其是易碎品），提供充分的防破损措施，保障快件安全派送。 3)
        客户不得交寄有爆炸性、易燃性、腐蚀性、放射性、毒性的危险品、麻醉药品、生化制品、现金以及国家法律、法规禁止寄递的物品，不得隐瞒交寄快件的内件状况，配合本公司验视快件。需要的情况下客户应当依照国家规定出示相关部门的安全证明和有效证件。对已接受委托后发现属于不能安全、合法运送的物品（包括但不限于危险品、违禁品），自由服务人员保留拒绝运送的权利，并由客户承担违约责任，该物品将由自由服务人员经由本公司送交有关部门处理。客户匿报、隐蔽交寄禁寄和限寄物品导致本公司、自由服务人员或第三人人身或财产伤害的，客户应当向本公司、自由服务人员或第三人承担赔偿责任。
        11、自由服务人员有权并有义务依法收寄快件，对信件以外的快件按照国家有关规定应当当场验视，对违寄物品和拒绝验视的物品不予收寄。本公司向客户提供自交寄之日起一年内的查询服务。
        12、自由服务人员将快件送达收件人地址，经收件人或经收件人（客户）允许的代收人签字，视为送达。若无收件人姓名，仅有收件单位地址，则由单位收件人员签字，视为送达,特殊部门单位(如政府部门)不能提供签字，以签收信息上传，视为送达。
        13、赔偿标准：是否保价由客户自愿选择，贵重快件建议选择保价。 1) 若因自由服务人员原因造成快件毁损、灭失的，将免除本次运费。 2)
        若客户未选择保价，丢失、损毁、短少，文件/物品最高赔偿不超过1000元/票，如核销单、提单等重要文件，建议保价，否则按未保价文件标准赔付，另有约定的按约定办理。 3)
        若客户已选择保价，若快件仅有部分毁损或内件短少，则按照投保金额和损失的比例赔偿。若快件丢失、损毁、短少的，按照实际损失价值赔偿，但最高不超过快件的保价金额。快件残值由本公司组织自由服务人员和客户双方协商处理；如折归客户，在核定赔偿金额时将扣减残值。
        4) 自由服务人员不承担丢失、损毁、短少导致的一切预期可利益损失或间接损失（快件可能获得的收益、利润、实际用途、商业机会、商业价值等） 5) 保价费为保价金额的1‰，最低收费2元。
        14、对于签单返还服务，若因自由服务人员原因导致签收回单毁损、灭失的，本公司将免费提供一次签单返还服务作为赔偿。
        15、索赔仅限快件交付验货时当场提出。快件签收后提出索赔要求的视为自动放弃索赔权利。对于客户提出的有效索赔，本公司将在三十日内作出答复。
        16、托运物重量计量单位为千克。按1kg以下，1-2kg，2-4kg，4kg以上分档计算费用。
        17、自由服务人员同意授权本公司自客户处代为收取配送费用。本公司在向月结客户代收月结款时提供发票；有发票需求的非月结客户，请在付款后1个月内凭下单号向本公司索取发票，逾期不再提供。
        18、本公司及自由服务人员对如下损失不承担责任： 1) 因不可抗力（包含但不限于自然灾害、政府行为、战争等社会异常事件）造成货物损坏、短缺、灭失、污染、变质或迟延交付； 2)
        因货物本身的自然性质、质量瑕疵或缺陷、合理损耗等造成的损失； 3) 客户自行包装或容器不良，但从外部无法发现； 4) 客户自行包装，到达时外包装完好而内件缺少或损坏； 5)
        自由服务人员包装的非新品运输，外包装完好而内件缺少或损坏； 6) 由于客户故意或过失导致损失； 19、客户在平台在线商城所购买的商品，除商品质量问题外，平台概不接受退换货。 20、
        配送时间由校园大使和用户协商确定。 21、用户不能恶意刷单，经确认发现客户有恶意刷单行为的或未刷单成功但已被发现的，平台将有权收回全部赠送金额。
        22、本契约条款未作约定的，或本契约条款与国家相关法律法规的规定相冲突的，按照相关法律法规的规定执行。本契约内容同时包括本公司可能不断发布或更新的相关契约内容。上述内容一经正式发布，即为本契约条款不可分割的组成部分。本公司将在E校拼平台（E校拼官网、微信公众号和名称为"E校拼"的APP应用）上公布更新。
      </text>
    </rich-text>

    <rich-text v-if="judge == 1">
      <view class="text-sm" style="text-align: center">校园大使条款</view>
      <text class="text-sm"
        >请仔细阅读并同意以下用户协议：
        首先感谢您使用《E校拼》的产品和服务。本协议是用户（下称“您”），包括注册用户及没注册的访客（访客适用部分条款的约束），以注册、访问或浏览方式使用《E校拼》的产品和服务时与我们签署的协议
        请留意：您对《E校拼》产品和服务的使用即视为对本协议的签署，具有法律约束力。 隐私政策
        说明：本平台尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，本平台会按照本隐私权政策的规定使用和披露您的个人信息。但本平台将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本平台不会将这些信息对外披露或向第三方提供。本平台会不时更新本隐私权政策。
        您在同意本平台服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本平台服务使用协议不可分割的一部分。
      </text>
      <text class="text-sm">
        1.适用范围 (a) 在您注册本平台帐号时，您根据本平台要求提供的个人注册信息； (b) 本平台通过合法途径从商业伙伴处取得的用户个人数据。 您了解并同意，以下信息不适用本隐私权政策： (a)
        您在使用本平台提供的搜索服务时输入的关键字信息； (b) 本平台收集到的您在本平台发布的有关信息数据，包括但不限于参与活动、成交信息及评价详情； (c)
        违反法律规定或违反本平台规则行为及本平台已对您采取的措施。 2.信息使用
        (a)本平台不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和本平台（含本平台关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。
        (b) 本平台亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本平台用户如从事上述活动，一经发现，本平台有权立即终止与该用户的服务协议
        (c)为服务用户的目的，本平台可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与本平台合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。
        3.信息披露 在如下情况下，本平台将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息： (a) 经您事先同意，向第三方披露； (b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息； (c)
        根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露； (d) 如您出现违反中国有关法律、法规或者本平台服务协议或相关规则的情况，需要向第三方披露； (e)
        在本平台平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，本平台有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。 (f)
        其它本平台根据法律、法规或者网站政策认为合适的披露。 4、校园大使行为规则： （1）快递丢失照价赔偿 （2）校园大使抢单成功后无法退单 （3）客户评价优秀者优先派单
        （4）接到客户投诉的校园大使有义务自行解决安抚用户投诉问题，经平台回访限期内未解决投诉事宜，平台有权3倍扣除相应服务佣金以补贴用户 （5）校园大使严格遵从与客户协调时间内送达快递 5、协议变更及通知
        1. E校拼校园大使可根据国家法律法规变化及维护交易秩序、保护消费者权益的需要，单方面不时修改、补充本协议。
        2. 如您对变更事项不同意的，您应当于变更事项确定的生效之日起停止使用E校拼校园大使平台服务，变更事项对您不产生效力；如您在变更事项生效后仍继续使用E校拼校园大使平台服务，则视为您同意已生效的变更事项。
        3. 您同意E校拼校园大使以下列任何一种方式向您送达各类通知： （1）在E校拼校园大使官方网站等公开平台公示的文案； （2）站内信、弹出消息、客户端推送消息；
        （3）根据您预留于E校拼校园大使平台的联系方式发出的电子邮件、短信、函件等； （4）其他法律或商业惯例认定的通知方式。 6、法律管辖及适用
        1. 本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，如无相关法律规定的，则应参照通行惯例或公众道德标尺。
        2.如双方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向E校拼校园大使平台所在地的人民法院提起诉讼。
        3. 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。 4.本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。 7、税费缴纳条款 (a)
        . 根据我国法律及税收政策，“E校拼校园大使”平台及“E校拼校园大使骑士版”平台的   所有用户有义务就本人在平台上的劳务报酬所得（包括但不限于“快服    
        务”平台、“E校拼校园大使骑士版”平台订单所得）按时、足额的缴纳相关税     费。“E校拼校园大使”及“E校拼校园大使骑士版”平台有权随时根据税务部门的最新政策  
        或指导意见，即时调整用户税款缴纳问题的执行方式及相关规定。如果国家   相关规定或新的规定确定平台对于缴纳税款的相关义务，平台有权依法随时  
        变更骑士及商户的税务缴纳方式，且对于需要补交的相关款项，有权要求骑   士和商户进行补缴。 (b)
        用户在此确认如下，“E校拼校园大使”平台保有如下所示单项权利：若相关税务部门要求“E校拼校园大使”提供用户账户信息以核实用户自行申报的在平台收入具体数额，平台有权不经用户同意而进行披露，并根据国家法律配合相关税务部门的其他合法要求。
      </text>
    </rich-text>
  </view>
</template>

<script>
export default {
  data() {
    return {
      judge: 0
    };
  },
  onLoad(option) {
    this.judge = option.judge; // 0.用户条款，1.大使条款
  }
};
</script>

<style lang="scss">
page {
  background: #fff;
}
.container {
  padding-top: 115px;
  position: relative;
  width: 100vw;
  height: 100vh;
  overflow: hidden;
  background: #fff;
}
</style>
